In [64]:
import numpy as np
import pandas as pd

In [65]:
# Load dataset
df = pd.read_excel(r"C:\Users\chand\Downloads\HR Data Analytics.xlsx")

In [66]:
df.head()

,Attrition,Business Travel,CF_age band,CF_attrition label,Department,Education Field,emp no,Employee Number,Gender,Job Role,...,Performance Rating,Relationship Satisfaction,Standard Hours,Stock Option Level,Total Working Years,Work Life Balance,Years At Company,Years In Current Role,Years Since Last Promotion,Years With Curr Manager
0,Yes,Travel_Rarely,35 - 44,Ex-Employees,Sales,Life Sciences,STAFF-1,1,Female,Sales Executive,...,3,1,80,0,8,1,6,4,0,5
1,No,Travel_Frequently,45 - 54,Current Employees,R&D,Life Sciences,STAFF-2,2,Male,Research Scientist,...,4,4,80,1,10,3,10,7,1,7
2,Yes,Travel_Rarely,35 - 44,Ex-Employees,R&D,Other,STAFF-4,4,Male,Laboratory Technician,...,3,2,80,0,7,3,0,0,0,0
3,No,Travel_Frequently,25 - 34,Current Employees,R&D,Life Sciences,STAFF-5,5,Female,Research Scientist,...,3,3,80,0,8,3,8,7,3,0
4,No,Travel_Rarely,25 - 34,Current Employees,R&D,Medical,STAFF-7,7,Male,Laboratory Technician,...,3,4,80,1,6,3,2,2,2,2

In [67]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1470 entries, 0 to 1469
Data columns (total 41 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Attrition                   1470 non-null   object
 1   Business Travel             1470 non-null   object
 2   CF_age band                 1470 non-null   object
 3   CF_attrition label          1470 non-null   object
 4   Department                  1470 non-null   object
 5   Education Field             1470 non-null   object
 6   emp no                      1470 non-null   object
 7   Employee Number             1470 non-null   int64
 8   Gender                      1470 non-null   object
 9   Job Role                    1470 non-null   object
 10  Marital Status              1470 non-null   object
 11  Over Time                   1470 non-null   object
 12  Over18                      1470 non-null   object
 13  Training Times Last Year    1470 non-null   int64
 14  -2                          1470 non-null   int64
 15  0                           1470 non-null   int64
 16  Age                         1470 non-null   int64
 17  CF_current Employee         1470 non-null   int64
 18  Daily Rate                  1470 non-null   int64
 19  Distance From Home          1470 non-null   int64
 20  Education                   1470 non-null   object
 21  Employee Count              1470 non-null   int64
 22  Environment Satisfaction    1470 non-null   int64
 23  Hourly Rate                 1470 non-null   int64
 24  Job Involvement             1470 non-null   int64
 25  Job Level                   1470 non-null   int64
 26  Job Satisfaction            1470 non-null   int64
 27  Monthly Income              1470 non-null   int64
 28  Monthly Rate                1470 non-null   int64
 29  Num Companies Worked        1470 non-null   int64
 30  Percent Salary Hike         1470 non-null   int64
 31  Performance Rating          1470 non-null   int64
 32  Relationship Satisfaction   1470 non-null   int64
 33  Standard Hours              1470 non-null   int64
 34  Stock Option Level          1470 non-null   int64
 35  Total Working Years         1470 non-null   int64
 36  Work Life Balance           1470 non-null   int64
 37  Years At Company            1470 non-null   int64
 38  Years In Current Role       1470 non-null   int64
 39  Years Since Last Promotion  1470 non-null   int64
 40  Years With Curr Manager     1470 non-null   int64
dtypes: int64(28), object(13)
memory usage: 471.0+ KB

In [68]:
df.describe(include = 'all')

,Attrition,Business Travel,CF_age band,CF_attrition label,Department,Education Field,emp no,Employee Number,Gender,Job Role,...,Performance Rating,Relationship Satisfaction,Standard Hours,Stock Option Level,Total Working Years,Work Life Balance,Years At Company,Years In Current Role,Years Since Last Promotion,Years With Curr Manager
count,1470,1470,1470,1470,1470,1470,1470,1470.000000,1470,1470,...,1470.000000,1470.000000,1470.0,1470.000000,1470.000000,1470.000000,1470.000000,1470.000000,1470.000000,1470.000000
unique,2,3,5,2,3,6,1470,NaN,2,9,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
top,No,Travel_Rarely,25 - 34,Current Employees,R&D,Life Sciences,STAFF-1,NaN,Male,Sales Executive,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
freq,1233,1043,554,1233,961,606,1,NaN,882,326,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
mean,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1024.865306,NaN,NaN,...,3.153741,2.712245,80.0,0.793878,11.279592,2.761224,7.008163,4.229252,2.187755,4.123129
std,NaN,NaN,NaN,NaN,NaN,NaN,NaN,602.024335,NaN,NaN,...,0.360824,1.081209,0.0,0.852077,7.780782,0.706476,6.126525,3.623137,3.222430,3.568136
min,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1.000000,NaN,NaN,...,3.000000,1.000000,80.0,0.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000
25%,NaN,NaN,NaN,NaN,NaN,NaN,NaN,491.250000,NaN,NaN,...,3.000000,2.000000,80.0,0.000000,6.000000,2.000000,3.000000,2.000000,0.000000,2.000000
50%,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1020.500000,NaN,NaN,...,3.000000,3.000000,80.0,1.000000,10.000000,3.000000,5.000000,3.000000,1.000000,3.000000
75%,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1555.750000,NaN,NaN,...,3.000000,4.000000,80.0,1.000000,15.000000,3.000000,9.000000,7.000000,3.000000,7.000000
max,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2068.000000,NaN,NaN,...,4.000000,4.000000,80.0,3.000000,40.000000,4.000000,40.000000,18.000000,15.000000,17.000000

In [69]:
df.isnull().sum()

Attrition                     0
Business Travel               0
CF_age band                   0
CF_attrition label            0
Department                    0
Education Field               0
emp no                        0
Employee Number               0
Gender                        0
Job Role                      0
Marital Status                0
Over Time                     0
Over18                        0
Training Times Last Year      0
-2                            0
0                             0
Age                           0
CF_current Employee           0
Daily Rate                    0
Distance From Home            0
Education                     0
Employee Count                0
Environment Satisfaction      0
Hourly Rate                   0
Job Involvement               0
Job Level                     0
Job Satisfaction              0
Monthly Income                0
Monthly Rate                  0
Num Companies Worked          0
Percent Salary Hike           0
Performance Rating            0
Relationship Satisfaction     0
Standard Hours                0
Stock Option Level            0
Total Working Years           0
Work Life Balance             0
Years At Company              0
Years In Current Role         0
Years Since Last Promotion    0
Years With Curr Manager       0
dtype: int64

In [70]:
# Basic cleaning
df.columns = df.columns.str.strip().str.lower()

In [71]:
df.columns

Index(['attrition', 'business travel', 'cf_age band', 'cf_attrition label',
       'department', 'education field', 'emp no', 'employee number', 'gender',
       'job role', 'marital status', 'over time', 'over18',
       'training times last year', '-2', '0', 'age', 'cf_current employee',
       'daily rate', 'distance from home', 'education', 'employee count',
       'environment satisfaction', 'hourly rate', 'job involvement',
       'job level', 'job satisfaction', 'monthly income', 'monthly rate',
       'num companies worked', 'percent salary hike', 'performance rating',
       'relationship satisfaction', 'standard hours', 'stock option level',
       'total working years', 'work life balance', 'years at company',
       'years in current role', 'years since last promotion',
       'years with curr manager'],
      dtype='object')

In [72]:
# Handle missing values
df['monthly income'].fillna(df['monthly income'].median(), inplace=True)
df['job satisfaction'].fillna(df['job satisfaction'].mode()[0], inplace=True)

In [73]:
# Convert categorical fields
df['attrition_flag'] = df['attrition'].map({'Yes': 1, 'No': 0})

In [74]:
# Loyalty score (example feature)
df['loyalty_score'] = df['years at company'] * df['job satisfaction']

In [75]:
df.head()

,attrition,business travel,cf_age band,cf_attrition label,department,education field,emp no,employee number,gender,job role,...,standard hours,stock option level,total working years,work life balance,years at company,years in current role,years since last promotion,years with curr manager,attrition_flag,loyalty_score
0,Yes,Travel_Rarely,35 - 44,Ex-Employees,Sales,Life Sciences,STAFF-1,1,Female,Sales Executive,...,80,0,8,1,6,4,0,5,1,24
1,No,Travel_Frequently,45 - 54,Current Employees,R&D,Life Sciences,STAFF-2,2,Male,Research Scientist,...,80,1,10,3,10,7,1,7,0,20
2,Yes,Travel_Rarely,35 - 44,Ex-Employees,R&D,Other,STAFF-4,4,Male,Laboratory Technician,...,80,0,7,3,0,0,0,0,1,0
3,No,Travel_Frequently,25 - 34,Current Employees,R&D,Life Sciences,STAFF-5,5,Female,Research Scientist,...,80,0,8,3,8,7,3,0,0,24
4,No,Travel_Rarely,25 - 34,Current Employees,R&D,Medical,STAFF-7,7,Male,Laboratory Technician,...,80,1,6,3,2,2,2,2,0,4

In [76]:
# Dimension Table: Employee
dim_employee = df[['employee number','age','gender','department']].drop_duplicates()

# Fact Table: HR Metrics
fact_hr = df[['employee number','monthly income','job satisfaction',
              'attrition_flag','loyalty_score','performance rating']]

In [77]:
dim_employee

      employee number  age  gender department
0                   1   41  Female      Sales
1                   2   49    Male        R&D
2                   4   37    Male        R&D
3                   5   33  Female        R&D
4                   7   27    Male        R&D
...               ...  ...     ...        ...
1465             1905   34    Male        R&D
1466             1868   29    Male        R&D
1467             1667   35    Male      Sales
1468             1878   22    Male        R&D
1469             1702   23    Male      Sales

[1470 rows x 4 columns]

In [78]:
fact_hr

,employee number,monthly income,job satisfaction,attrition_flag,loyalty_score,performance rating
0,1,5993,4,1,24,3
1,2,5130,2,0,20,4
2,4,2090,3,1,0,3
3,5,2909,3,0,24,3
4,7,3468,2,0,4,3
...,...,...,...,...,...,...
1465,1905,2307,1,1,5,4
1466,1868,2439,4,1,4,4
1467,1667,4581,4,1,44,4
1468,1878,2472,2,1,2,4
1469,1702,2275,4,1,12,4

In [79]:
pip install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\chand\appdata\local\programs\python\python314\lib\site-packages (2.0.45)
Requirement already satisfied: greenlet>=1 in c:\users\chand\appdata\local\programs\python\python314\lib\site-packages (from sqlalchemy) (3.3.0)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\chand\appdata\local\programs\python\python314\lib\site-packages (from sqlalchemy) (4.15.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 25.2 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

In [80]:
pip install pyodbc

Requirement already satisfied: pyodbc in c:\users\chand\appdata\local\programs\python\python314\lib\site-packages (5.3.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 25.2 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

In [81]:
import pandas as pd
from sqlalchemy import create_engine
from urllib.parse import quote_plus

# SQL Server details
server = r'NIKHILC\SQLEXPRESS'
database = 'HR_Analytics'

# URL encode the driver name (avoid issues with spaces)
driver = quote_plus("ODBC Driver 17 for SQL Server")

# Create SQLAlchemy engine using Windows Authentication
engine = create_engine(
    f"mssql+pyodbc://{server}/{database}?driver={driver}&trusted_connection=yes"
)

# Example DataFrames (replace with your actual data)
# dim_employee = pd.DataFrame(...)
# fact_hr = pd.DataFrame(...)

# Write DataFrames to SQL Server
dim_employee.to_sql('dim_employee', engine, if_exists='replace', index=False)
fact_hr.to_sql('fact_hr', engine, if_exists='replace', index=False)

print("Tables written successfully!")

Tables written successfully!

In [82]:
import warnings
from sqlalchemy.exc import SAWarning

warnings.filterwarnings("ignore", category=SAWarning)

In [83]:
dim_employee.to_sql('dim_employee', engine, schema='dbo', if_exists='replace', index=False)
fact_hr.to_sql('fact_hr', engine, schema='dbo', if_exists='replace', index=False)

74